---
kind: property
id: P:Autodesk.Revit.DB.Analysis.MEPNetworkSegmentData.VelocityPressure
source: html/14ce6033-ad83-e724-d440-d72eb6823ec9.htm
---
# Autodesk.Revit.DB.Analysis.MEPNetworkSegmentData.VelocityPressure Property

The calculated velocity pressure of this segment, in kg/(ft*s^2).

## Syntax (C#)
```csharp
public double VelocityPressure { get; }
```